<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Illuminate\Support\Facades\Mail;

class MenuController extends Controller
{
    public function index(){
        $datas = [
            'ジュージュー焼き（ご飯、スープ、サラダ付）★',
            'ポークジンジャー（ご飯、スープ、サラダ付）★',
            '深川亭特製カレーライス（スープ、サラダ付、大盛り150円増）' ,
            'ピリ辛おじや（サラダ付き、大盛り150円増）',
            '深川丼（サラダ付）★',
            '本日の日替わり　★'
        ];
        $teppan = [
            'ジュージュー焼き' => '980',
            'ポークジンジャー' => '1100',
            '豚のガーリック風味' => '1100',
            'ポーク天ぷら' => '1100',
            'スルメイカのバターソティー' => '1100',
            'スルメイカの肝焼き' => '1100',
            'パンのチーズ風味' => '770',
            'チーズおやき' => '880',
            '山芋ステーキ' => '770',
            'チョリソー' => '770'
        ];
        $tetunabe = [
            '深川亭特製カレーライス' => '1100',
            'ピリ辛おじや' => '1100',
            'ロールキャベツ' => '1380',
            '深川丼' => '1100',
        ];
        $fish = [
            '旬の魚の味噌たたき' => '1100',
            '旬の魚のヅケ' => '1100',
            '旬の魚のヅケ茶漬け' => '1100',
            '旬の魚のまご茶漬け' => '1100',
            '旬の魚のカルパッチョ' => '1380',
        ];
        $vegitable = [
            '丸ごとキュウリ　特製味噌添え' => '440',
            '大根スティック　特製味噌添え' => '440',
            'たたきキュウリ' => '440',
            '冷やしトマト' => '550',
            '野菜盛り' => '880',
            'ポテトサラダ' => '600',
            '春雨サラダ' => '600',
            'フレッシュトマトと生ハムサラダ' => '1380',
        ];
        $others = [
            'じゃがいものふわふわ揚げ' => '800',
            'ポテトフライ　チーズソース' => '1100',
            'カマンベールチーズと生ハムの盛り合わせ' => '1380',
            '若鶏のから揚げ' => '1380',
            '豚冷しゃぶ' => '1100',
            '天ぷら盛り合わせ' => '2750',
            '茶漬け風変わりうどん' => '1100',
            'ハヤシライス' => '1100',
            'ピリ辛チャーハン' => '1100',
            '煮込みカレーリゾット風' => '1100',
            'ふわふわ卵のオムライス' => '1760',
            '自家製ピザ（トマトソース・生ハム）' => '2100',
        ];
        $corses = [
            '元加賀コース（要予約)' => '3500',
            '木場コース(要予約)' => '4500',
            '深川コース(要予約)' => '5500'
        ];
        return view('menu',compact('datas','teppan','tetunabe','fish','vegitable','others','corses'));
    }
}
